# IsModifiableSpec Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Units..::..IsModifiableSpec Method
Units Class See Also
---
Checks whether the default FormatOptions can be modified for a given spec.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public static bool IsModifiableSpec(
	ForgeTypeId specTypeId
)
```

Visual Basic
---
```text
Public Shared Function IsModifiableSpec ( _
	specTypeId As ForgeTypeId _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsModifiableSpec(
	ForgeTypeId^ specTypeId
)
```

# ### Parameters
specTypeId
    Type: Autodesk.Revit.DB..::..ForgeTypeId Identifier of the spec to check.
# ### Return Value
True if the FormatOptions can be modified, false otherwise.
# Remarks
The Units class stores a FormatOptions object for every spec, but not all of them can be directly modified. Some have fixed definitions.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Units Class
Autodesk.Revit.DB Namespace